### Ordinal Number Encoding

#### Grading System --- A,B,C,D,F  

A-1  
B-2  
C-3  
D-4  
F-5  

#### Experience of A Batsman  

A- 10 yr --- 1  
B- 5 yr --- 2  
C- 3 yr --- 3  

#### Week days and Weekend  

Mon, Tue, Wed, Thu, Fri, Sat, Sun  

Sun -- 1  
Sat -- 2

In [1]:
import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2022, 10, 6, 10, 39, 56, 973237)

In [4]:
today_date - datetime.timedelta(1)

datetime.datetime(2022, 10, 5, 10, 39, 56, 973237)

In [5]:
## List Comprehension
days = [today_date - datetime.timedelta(x) for x in range(0,15)]

In [6]:
import pandas as pd

data = pd.DataFrame(days)
data.columns=["Day"]

In [7]:
data['Week Day'] = data['Day'].dt.day_name()
data.head()

                         Day   Week Day
0 2022-10-06 10:39:56.973237   Thursday
1 2022-10-05 10:39:56.973237  Wednesday
2 2022-10-04 10:39:56.973237    Tuesday
3 2022-10-03 10:39:56.973237     Monday
4 2022-10-02 10:39:56.973237     Sunday

In [8]:
dictionary={
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [9]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [10]:
data['Week Day Ordinal']= data['Week Day'].map(dictionary)

In [11]:
data

                          Day   Week Day  Week Day Ordinal
0  2022-10-06 10:39:56.973237   Thursday                 4
1  2022-10-05 10:39:56.973237  Wednesday                 3
2  2022-10-04 10:39:56.973237    Tuesday                 2
3  2022-10-03 10:39:56.973237     Monday                 1
4  2022-10-02 10:39:56.973237     Sunday                 7
5  2022-10-01 10:39:56.973237   Saturday                 6
6  2022-09-30 10:39:56.973237     Friday                 5
7  2022-09-29 10:39:56.973237   Thursday                 4
8  2022-09-28 10:39:56.973237  Wednesday                 3
9  2022-09-27 10:39:56.973237    Tuesday                 2
10 2022-09-26 10:39:56.973237     Monday                 1
11 2022-09-25 10:39:56.973237     Sunday                 7
12 2022-09-24 10:39:56.973237   Saturday                 6
13 2022-09-23 10:39:56.973237     Friday                 5
14 2022-09-22 10:39:56.973237   Thursday                 4

#### Count Or Frequency Encoding

In [12]:
import pandas as pd

train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [13]:
columns = [1,3,5,6,7,8,9,13]

In [14]:
train_set = train_set[columns]

In [15]:
train_set[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [16]:
train_set.columns = ["Employment","Degree","Status","Designation","Family_Job","Race","Sex","Country"]

In [17]:
train_set.head()

,Employment,Degree,Status,Designation,Family_Job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [18]:
train_set['Employment'].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [19]:
for feature in train_set.columns:
    print(feature,":",len(train_set[feature].unique()),"labels")

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_Job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [20]:
train_set.columns

Index(['Employment', 'Degree', 'Status', 'Designation', 'Family_Job', 'Race',
       'Sex', 'Country'],
      dtype='object')

In [23]:
country_map = train_set["Country"].value_counts().to_dict()

In [24]:
train_set["Country"] = train_set["Country"].map(country_map)

In [25]:
train_set.head()

,Employment,Degree,Status,Designation,Family_Job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
1. Easy To Use
2. Not increasing feature space

#### Disadvantages
1. It will provide same weight if the frequencies are same

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [26]:
import pandas as pd

df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [27]:
df["Cabin"].fillna("Missing",inplace=True)

In [29]:
df.head(10)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [30]:
df["Cabin"] = df["Cabin"].astype(str).str[0]

In [31]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [32]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [35]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [39]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [40]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [41]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [46]:
enumerate(ordinal_labels,0)

In [49]:
ordinal_dict = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_dict

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [50]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_dict)

In [51]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [53]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [54]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [55]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

#### Advantages
1. It capture information within the label